# temps = [35, 32, 31, 22, 21, 20, 25, 19]
# for t in temps:
#     if t >= 30:
#         print(f"고온: {t} ", end = '')
# print()


#############################################################################################
 
# act_time = [8, 6, 10, 9, 11, 4, 2, 3, 14, 15]
# for t in act_time:
#     if t >= 5 and t <= 10:
#         print(t, end = " ")
# print()

#############################################################################################

temps = [36, 32, 31, 22, 21, 20, 25, 19]
sum = 0
count = 0
for t in temps:
    if t > 30:
        sum += t
        count += 1
print("고온 평균: ", sum / count)
print()

#############################################################################################

temps = [35, 32, 31, 33, 22, 21, 20, 25, 19]
high_temps = []
for t in temps:
    if t > 30:
        high_temps.append(t)
print(temps, '/', high_temps, ', 개수: ', len(high_temps))
print()

#############################################################################################

temps_c = [35, 32, 31, 33, 22, 21, 20, 25, 19]
temps_f = []
for t in temps_c:
    t = t*1.8 + 32
    temps_f.append(round(t, 2))
print(f"섭씨 온도: {temps_c}")
print(f"화씨 온도: {temps_f}")